{
  "recipes": [
    {
      "id": 638893,
      "pricePerServing": 385.84,
      "servings": 6,
      "readyInMinutes": 45,
      "image": "https://img.spoonacular.com/recipes/638893-556x370.jpg",
      "title": "Chocolate Cherry Cheesecake",
      "summary": "Chocolate Cherry Cheesecake takes about <b>45 minutes</b> from beginning to end. This recipe makes 6 servings with <b>781 calories</b>, <b>22g of protein</b>, and <b>46g of fat</b> each. For <b>$3.86 per serving</b>, this recipe <b>covers 19%</b> of your daily requirements of vitamins and minerals. 2 people were glad they tried this recipe. Only a few people really liked this dessert. It is brought to you by Foodista. Head to the store and pick up flour, cherries, salt, and a few other things to make it today. With a spoonacular <b>score of 41%</b>, this dish is good. Try <a href=\"https://spoonacular.com/recipes/chocolate-cherry-cheesecake-554137\">Chocolate Cherry Cheesecake</a>, <a href=\"https://spoonacular.com/recipes/chocolate-cherry-cheesecake-1371817\">Chocolate Cherry Cheesecake</a>, and <a href=\"https://spoonacular.com/recipes/chocolate-cherry-cheesecake-1341633\">Chocolate Cherry Cheesecake</a> for similar recipes.",
      "analyzedInstructions": [
        {
          "steps": [
            {
              "number": 1,
              "step": "Grease a 10 inch springform pan and line with a baking paper. To prepare the curst, combine and sieve first five ingredients first in a bowl, cut in butter and egg until a smooth dough forms. Press firmly on the bottom and sides of prepare pan. Use a fork to prick the crust in regular intervals. Cover and chill the crust for 30 minutes.Pre-heat oven to 200C/400F. Stir chopped chocolate and sugar in a heatproof bowl set over a pan of simmering water until melted and smooth."
            },
            {
              "number": 2,
              "step": "Remove bowl from over water and stir in the vanilla extract."
            },
            {
              "number": 3,
              "step": "Let cool briefly until lukewarm but still pourable.Blend quark and cream cheese in another bowl until smooth."
            }
          ]
        }
      ]
    }
  ]
}
